[
    {
        "id": "appendicitis",
        "category": "Lower GI",
        "name": "Acute Appendicitis",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Can you point with one finger where the pain is most severe?\" (McBurney's Point)</li><li>\"Did the pain start around your belly button and move to the right?\" (Classic Migration)</li><li>\"Does the pain get worse when you cough, walk, squat, or go over speed bumps in a car?\" (Peritoneal irritation - Dunphy's sign)</li><li>\"Have you lost your appetite completely?\" (Hamburger Sign - Anorexia is a strong negative predictor if absent)</li><li>\"Do you have any pain on urination?\" (Rule out pelvic appendix irritating bladder or UTI)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Mesenteric Adenitis:</strong> Common in children, history of recent URI, high fever, shifting tenderness, cervical lymphadenopathy.</li><li><strong>Ectopic Pregnancy/Ovarian Pathology:</strong> Missed period, adnexal tenderness, complex cyst on USG. (Always do U-HCG in females).</li><li><strong>Ureteric Colic:</strong> Severe loin to groin pain, patient is restless (not still), hematuria.</li><li><strong>Terminal Ileitis:</strong> History of Crohn's, diarrhea, Yersinia infection.</li><li><strong>Meckel's Diverticulitis:</strong> Clinically indistinguishable pre-operatively, rule of 2s.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3>The classic presentation (seen in ~50% of cases) begins as a dull, diffuse, visceral discomfort in the periumbilical region (T10 dermatome via sympathetic afferents). Within 6-24 hours, as the inflammation spreads to the parietal peritoneum, the pain shifts and localizes to the Right Iliac Fossa (RIF), becoming sharp and somatic in nature. <br><br><strong>Aggravating Factors:</strong> The patient will typically report that the pain worsens with movement, deep breathing, coughing, walking, <strong>squatting</strong>, or <strong>riding in a car</strong> (especially going over bumps - Dunphy's sign). <br><br><strong>Associated Symptoms:</strong> Anorexia is almost invariably present (if the patient is hungry, reconsider the diagnosis). Nausea and vomiting typically follow the onset of pain (Murphy's Chronology: Pain -> Vomiting -> Fever). Constipation is more common than diarrhea (which may suggest pelvic appendix). <br><br><strong>Systemic:</strong> A low-grade fever (<38°C) is common. High fever (>39°C) with rigors suggests perforation or gangrene.",
        "physiology": "<h3>Pathophysiology</h3>The initiating event is luminal obstruction of the appendix. <br><strong>Common Causes:</strong> Fecaliths (hard stool concretions - common in adults), Lymphoid Hyperplasia (common in children/viral infection), seeds, parasites (<em>Enterobius vermicularis</em>), or rarely tumors (Carcinoid). <br><br><strong>Mechanism (Step-by-Step):</strong> <br>1. <strong>Obstruction:</strong> Blockage leads to continued mucus secretion within the closed loop. <br>2. <strong>Distension:</strong> Increased intraluminal pressure stimulates visceral afferent nerves (T10) -> Periumbilical pain. <br>3. <strong>Venous Stasis:</strong> Pressure exceeds venous pressure -> Venous engorgement and edema. <br>4. <strong>Inflammation:</strong> Bacterial overgrowth (E. coli, Bacteroides, Pseudomonas) invades the wall. Inflammation reaches serosa -> RIF pain. <br>5. <strong>Arterial Compromise:</strong> Pressure exceeds arterial pressure -> Ischemia (Ellipsoid infarct on antimesenteric border). <br>6. <strong>Gangrene & Perforation:</strong> Wall breakdown -> Spillage of pus/feces -> Generalized Peritonitis or Abscess formation.",
        "exam": "<h3>General Appearance</h3>The patient looks unwell, flushed (fetor oris), and lies still in bed, often with the right hip flexed to relax the iliopsoas muscle. Tachycardia and low-grade pyrexia are common. <br><br><strong>Abdominal Examination:</strong> <br>1. <strong>Inspection:</strong> Limitation of respiratory movement in the RIF. <br>2. <strong>Palpation:</strong> Maximal tenderness at McBurney's point (junction of lateral 1/3 and medial 2/3 of spino-umbilical line). <strong>Guarding</strong> (voluntary muscle spasm) and <strong>Rigidity</strong> (involuntary spasm) indicate peritonitis. <strong>Rebound tenderness</strong> (Blumberg's sign) is painful on release of pressure. <br>3. <strong>Special Signs:</strong> <br>- <strong>Rovsing's Sign:</strong> Palpation of LLQ causes pain in RIF (gas displacement). <br>- <strong>Psoas Sign:</strong> Pain on passive extension of the right thigh (Retrocecal appendix irritating psoas). <br>- <strong>Obturator Sign:</strong> Pain on internal rotation of the flexed right hip (Pelvic appendix irritating obturator internus). <br><br><strong>Red Flags:</strong> Board-like rigidity and absent bowel sounds suggest perforation.",
        "inv": "<h3>Bedside</h3><strong>Urine Dipstick:</strong> To exclude UTI (nitrites/leukocytes) and Renal Colic (hematuria). Note: An inflamed appendix near the ureter can cause microscopic hematuria/pyuria. <br><strong>Urine HCG:</strong> Mandatory in all women of reproductive age to rule out ectopic pregnancy. <br><br><h3>Laboratory</h3><strong>FBC:</strong> Leukocytosis (WBC >10) with a 'left shift' (neutrophilia). <br><strong>CRP:</strong> Elevated (>10mg/L). High CRP + High WBC has high predictive value. <br><br><h3>Imaging</h3><strong>Ultrasound (First Line for Kids/Women):</strong> Look for a non-compressible tubular structure >6mm diameter, 'target sign', aperistaltic, and periappendiceal fluid. <br><strong>CT Abdomen Contrast (Gold Standard for Adults/Elderly):</strong> Sensitivity 94%, Specificity 95%. Findings: Dilated appendix (>6mm), wall thickening, fat stranding, appendicolith, or abscess. Crucial to rule out malignancy in elderly.",
        "mgmt": "<h3>Resuscitation & Pre-op</h3><strong>NBM:</strong> Bowel rest. <strong>IV Fluids:</strong> Resuscitate with crystalloids (Hartmann's) to correct dehydration. <strong>Analgesia:</strong> IV Paracetamol/NSAIDs/Opioids (Modern teaching confirms analgesia does not mask signs). <strong>Antibiotics:</strong> IV Broad-spectrum (e.g., Cefuroxime + Metronidazole) to cover Gram-negatives and Anaerobes. Administer induction dose before incision. <br><br><h3>Surgical Management (Definitive)</h3><strong>Laparoscopic Appendectomy:</strong> The gold standard. Advantages: Diagnostic capability, better cosmesis, lower wound infection rate, faster recovery. <br><strong>Steps:</strong> Pneumoperitoneum -> Identify appendix (follow taenia coli to base of caecum) -> Create window in mesoappendix -> Divide mesoappendix (appendicular artery) -> Ligate base -> Remove in bag. <br><strong>Open Appendectomy:</strong> Via Gridiron (muscle splitting) or Lanz (transverse, better cosmetic) incision. Indicated if laparoscopy is contraindicated or difficult. <br><br><h3>Conservative (Ochsner-Sherren Regimen)</h3>Used for <strong>Appendix Mass</strong> (phlegmon). If the patient is stable with a palpable mass (omentum walling off infection), surgery is dangerous. <br><strong>Protocol:</strong> IV antibiotics, fluids, liquid diet, regular monitoring. If mass resolves, perform <strong>Interval Appendectomy</strong> 6-8 weeks later to prevent recurrence and rule out cancer (in >40y). If patient deteriorates -> Surgery.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Perforation:</strong> Leads to generalized peritonitis. Risk is highest in young children (thin wall/short omentum) and elderly.</li><li><strong>Appendiceal Mass/Abscess:</strong> Localized collection of pus. May require percutaneous drainage.</li><li><strong>Pylephlebitis:</strong> Septic thrombosis of the portal vein (rare but fatal). Presents with high fever, jaundice, and rigors.</li><li><strong>Gangrene:</strong> Necrosis of the appendix wall.</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Surgical Site Infection (SSI):</strong> Common after open surgery (reduced with lap).</li><li><strong>Pelvic Abscess:</strong> Collection in the pouch of Douglas. Causes diarrhea/mucus and fever 5-7 days post-op.</li><li><strong>Paralytic Ileus:</strong> Temporary bowel paralysis.</li><li><strong>Adhesive Intestinal Obstruction:</strong> Long-term risk (1-5%).</li><li><strong>Stump Appendicitis:</strong> Recurrence in a long stump left behind.</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Alvarado Score (MANTRELS)</div>Used to stratify risk. <br><strong>M</strong>igration (1) <br><strong>A</strong>norexia (1) <br><strong>N</strong>ausea/Vomit (1) <br><strong>T</strong>enderness in RIF (2) <br><strong>R</strong>ebound (1) <br><strong>E</strong>levated Temp (1) <br><strong>L</strong>eukocytosis (2) <br><strong>S</strong>hift to left (1) <br>Score <3: Unlikely. Score 7-10: High probability (Surgery).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Pregnancy</div>The appendix is displaced upward and outward by the gravid uterus. Pain may present in the <strong>Right Upper Quadrant (RUQ)</strong>, mimicking cholecystitis. Laparoscopy is safe in 1st/2nd trimester.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Baldwin's Sign</div>Pain in the right flank when flexing the right hip. Suggests a <strong>retrocecal appendix</strong> (lying against the psoas muscle).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Valentino's Syndrome</div>A perforated peptic ulcer where gastric contents track down the right paracolic gutter to the RIF, mimicking appendicitis.</div>"
    },
    {
        "id": "cholecystitis",
        "category": "Hepatobiliary",
        "name": "Acute Cholecystitis",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Does the pain radiate to your right shoulder or back?\" (Boas Sign - Phrenic nerve)</li><li>\"Did this start after a fatty meal?\" (CCK release)</li><li>\"How long has the pain lasted? Is it more than 6 hours?\" (Distinguishes from Colic)</li><li>\"Have you had fevers or shivers?\" (Suggests inflammation/infection)</li><li>\"Has your urine become dark or stools pale?\" (Suggests Complicated/CBD stone)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Biliary Colic:</strong> Pain <6h, No fever, Normal WBC, resolves spontaneously.</li><li><strong>Peptic Ulcer Disease:</strong> Burning epigastric pain, hunger pain, relieved by antacids.</li><li><strong>Acute Pancreatitis:</strong> Central pain radiating to back, relieved by sitting forward.</li><li><strong>Right Lower Lobe Pneumonia:</strong> Respiratory symptoms, fever, decreased breath sounds.</li><li><strong>Fitz-Hugh-Curtis Syndrome:</strong> Perihepatitis associated with PID in females.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3>The primary symptom typically begins as diffuse or periumbilical abdominal pain that eventually localizes to the <strong>Right Upper Quadrant (RUQ)</strong> or epigastrium. Unlike biliary colic, the pain is constant, severe, and persists for <strong>>6 hours</strong>. It frequently radiates to the right scapula (Boas' sign) or right shoulder tip (referred pain via phrenic nerve C3,4,5). <br><br><strong>Aggravating Factors:</strong> Pain is often triggered by a fatty meal. It worsens with deep inspiration (peritoneal irritation). <br><br><strong>Associated Symptoms:</strong> Anorexia, nausea, vomiting are common. Fever and chills indicate inflammation. <br><br><strong>Risk Factors (5 F's):</strong> Fat (Obesity/BMI >30), Female (Estrogen increases cholesterol saturation), Forty (Age >40), Fertile (Pregnancy/OCP use), Fair (Caucasian). Other risks include rapid weight loss, hemolytic anemia (pigment stones), and total parenteral nutrition (TPN).",
        "etiology": "<h3>Pathophysiology</h3><strong>Calculous Cholecystitis (95%):</strong> Obstruction of the cystic duct by a gallstone leads to bile stasis and gallbladder distension. This causes venous congestion, lymphatic stasis, and ischemia of the gallbladder wall. The trapped bile becomes concentrated and acts as a chemical irritant (Lysolecithin), triggering an inflammatory cascade. Secondary bacterial superinfection occurs in ~50% of cases. <br><br><strong>Acalculous Cholecystitis (5%):</strong> Occurs in critically ill patients (burns, sepsis, trauma, long-term ICU) due to bile stasis from fasting, dehydration, and systemic ischemia. It has a much higher mortality rate. <br><br><strong>Common Organisms:</strong> <em>Escherichia coli</em> (Most common), <em>Klebsiella</em>, <em>Enterococcus</em>, <em>Bacteroides</em>.",
        "exam": "<h3>General Inspection</h3>The patient appears unwell, flushed, and febrile. Tachycardia is common. The patient lies still to avoid peritoneal irritation (unlike the restless patient with renal colic). <br><br><strong>Abdominal Examination:</strong> <br>1. <strong>Inspection:</strong> Reduced movement of the right side of the abdomen during respiration. <br>2. <strong>Palpation:</strong> Tenderness and guarding in the RUQ. A mass may be palpable (Omentum wrapping the inflamed GB - Phlegmon). <br>3. <strong>Murphy's Sign:</strong> Ask the patient to exhale, place hand below the right costal margin. Ask patient to inhale deeply. The test is <strong>Positive</strong> if the patient suddenly stops breathing (inspiratory arrest) due to pain when the inflamed gallbladder descends onto the examining fingers. (Note: Must be negative on the left side to be valid). <br>4. <strong>Boas' Sign:</strong> Hyperaesthesia below the right scapula (T9-T11 dermatomes).",
        "inv": "<h3>Bedside</h3><strong>Urine Dipstick:</strong> Exclude renal colic, UTI, and DKA. <strong>ECG:</strong> Rule out inferior MI (can present as epigastric pain). <br><br><h3>Laboratory</h3><strong>FBC:</strong> Leukocytosis (WBC >10, neutrophilia). <strong>CRP:</strong> Elevated (Inflammatory marker). <strong>LFTs:</strong> Usually normal or mild non-specific derangement. Significant rise in Bilirubin or ALP suggests a CBD stone (Choledocholithiasis) or Mirizzi Syndrome. <strong>Amylase/Lipase:</strong> To exclude Gallstone Pancreatitis. <br><br><h3>Imaging</h3><strong>USG Abdomen (Gold Standard):</strong> <br>- <strong>Major Criteria:</strong> Gallstones, Positive sonographic Murphy's sign (tenderness with probe). <br>- <strong>Minor Criteria:</strong> Thickened GB wall (>3mm), Pericholecystic fluid, Distended gallbladder, Sludge. <br><strong>HIDA Scan:</strong> Functional scan. Used if USG is equivocal. Non-visualization of the gallbladder suggests cystic duct obstruction (Positive test). <br><strong>CT Abdomen:</strong> Not first line, but excellent for ruling out complications like emphysematous cholecystitis, gangrene, or perforation.",
        "mgmt": "<h3>Resuscitation</h3><strong>NBM:</strong> Bowel rest to stop CCK release. <strong>IV Fluids:</strong> Correct dehydration (Hartmann's/Saline). <strong>Analgesia:</strong> NSAIDs (e.g., Diclofenac/Indomethacin) are superior for biliary pain as they reduce prostaglandin release. Opioids (Morphine) if severe. <strong>Antiemetics:</strong> For nausea. <br><br><h3>Medical Treatment</h3><strong>IV Antibiotics:</strong> Broad-spectrum coverage required (e.g., Cefuroxime + Metronidazole, or Piperacillin-Tazobactam) to cover Enterobacteriaceae and Anaerobes. <br><br><h3>Surgical Management (Definitive)</h3><strong>Early Laparoscopic Cholecystectomy:</strong> Recommended within 72 hours of symptom onset (or within 1 week). This 'Hot Gallbladder' approach reduces hospital stay and costs compared to interval surgery (waiting 6 weeks). <br><strong>Conversion:</strong> Risk of converting to Open Cholecystectomy is higher in acute inflammation due to adhesions in Calot's triangle. <br><br><h3>Interventional (Tokyo Grade III)</h3><strong>Percutaneous Cholecystostomy:</strong> USG-guided drainage of the gallbladder. Reserved for high-risk surgical candidates (sepsis, organ failure, severe comorbidities) to 'cool down' the inflammation.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Empyema of Gallbladder:</strong> The gallbladder fills with pus (Mucocele becomes infected). Presents with high fever, rigors, and sepsis.</li><li><strong>Gangrenous Cholecystitis:</strong> Ischemia of the wall leads to necrosis. High risk of rupture.</li><li><strong>Biliary Peritonitis:</strong> Rupture of the gallbladder into the peritoneal cavity. High mortality.</li><li><strong>Cholecystoenteric Fistula:</strong> Inflammation causes the GB to adhere to the duodenum/colon and fistulate. Can lead to <strong>Gallstone Ileus</strong> (stone obstructs terminal ileum).</li><li><strong>Mirizzi Syndrome:</strong> Stone in cystic duct compresses the Common Hepatic Duct -> Jaundice.</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Bile Duct Injury (BDI):</strong> The most feared complication (0.3% risk). Transection or stricture of the CBD.</li><li><strong>Bile Leak:</strong> From the cystic duct stump or the Liver bed (Duct of Luschka).</li><li><strong>Retained Stone:</strong> A stone left in the CBD leading to jaundice/pancreatitis.</li><li><strong>Post-cholecystectomy Syndrome:</strong> Persistent pain after surgery (often due to SOD or missed pathology).</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Tokyo Guidelines 2018 (Severity Grading)</div><ul class=\"vertical-list\"><li><strong>Grade I (Mild):</strong> Healthy patient, limited inflammation. -> <strong>Early Lap Chole.</strong></li><li><strong>Grade II (Moderate):</strong> WBC >18, palpable tender mass, duration >72h, marked local inflammation. -> <strong>Antibiotics/Drainage then Surgery.</strong></li><li><strong>Grade III (Severe):</strong> Organ Dysfunction (Hypotension, confusion, respiratory failure). -> <strong>Urgent Drainage (Cholecystostomy) + ICU support.</strong></li></ul></div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Critical View of Safety</div>During surgery, before clipping the cystic duct, the surgeon must identify the <strong>Critical View of Safety</strong>: 1. The hepatocystic triangle (Calot's) is cleared of fat/fibrous tissue. 2. The lower 1/3 of the GB is separated from the liver bed. 3. Only two structures (Cystic Duct and Cystic Artery) are seen entering the GB.</div>"
    },
    {
        "id": "gallstones",
        "category": "Hepatobiliary",
        "name": "Gallstones (Biliary Colic)",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Does the pain come and go?\"</li><li>\"Does it go away <em>completely</em> between attacks?\" (Crucial distinction from Cholecystitis)</li><li>\"Is your urine dark or eyes yellow?\" (Rule out CBD stone)</li><li>\"Did this happen after eating greasy food?\"</li><li>\"Any fever or shivers?\" (Rule out Cholecystitis)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Acute Cholecystitis:</strong> Fever, pain >6h, positive Murphy's.</li><li><strong>Gastritis/GERD:</strong> Burning pain, acid relation.</li><li><strong>Pancreatitis:</strong> Back radiation, severe constant pain.</li><li><strong>Peptic Ulcer:</strong> Hunger pain, night pain.</li><li><strong>Renal Colic:</strong> Loin to groin pain.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Pain:</strong> Colicky Right Upper Quadrant (RUQ) or Epigastric pain. Often radiates to the back. <br><strong>Trigger:</strong> Often triggered post-prandially (1-2 hours after a meal), especially fatty/greasy food (CCK release). <br><strong>Duration:</strong> Pain typically lasts minutes to hours but is <strong><6 hours</strong>. Crucially, the pain resolves completely between attacks. <br><strong>Systemic:</strong> No fever, no shivers, no sweats. <br><strong>Associated:</strong> Nausea and vomiting are common during the height of the pain.",
        "physiology": "<h3>Pathophysiology & Etiology</h3><strong>Mechanism:</strong> Supersaturation of bile with cholesterol -> Nucleation of crystals -> Aggregation into stones. Biliary colic occurs when the gallbladder contracts against a stone temporarily obstructing the cystic duct. Relaxation allows the stone to fall back, relieving pain. <br><br><strong>Stone Types:</strong> <br>- <strong>Cholesterol (Mixed):</strong> 80% of stones. Radiolucent (don't show on X-ray). Associated with obesity, female gender. <br>- <strong>Pigment (Black):</strong> Calcium bilirubinate. Hemolysis, Cirrhosis. Radiopaque. <br>- <strong>Pigment (Brown):</strong> Infection/Stasis (Asian population, parasites). <br><br><strong>Risks:</strong> 5 Fs, Hemolysis, Crohn's (bile salt malabsorption), TPN.",
        "exam": "<h3>Signs</h3><strong>Abdomen:</strong> Soft and non-tender between attacks. During an attack, there may be mild RUQ tenderness but NO peritoneal signs (guarding/rebound). <br><strong>Murphy's Sign:</strong> Negative. <br><strong>Systemic:</strong> Afebrile, stable vitals. No jaundice (unless complications arise).",
        "inv": "<h3>Laboratory</h3><strong>Normal WBC, Normal CRP, and Normal LFTs.</strong> These are the crucial negative findings to distinguish simple colic from Acute Cholecystitis or Cholangitis. <br><br><h3>Imaging</h3><strong>USG Abdomen (Gold Standard):</strong> <br>- <strong>Findings:</strong> Gallstones with acoustic shadowing (\"stones in the gallbladder\"). <br>- <strong>Negatives:</strong> Gallbladder wall is thin/normal (<3mm). No pericholecystic fluid. CBD is normal caliber (<6mm).",
        "mgmt": "<h3>Conservative</h3><strong>Analgesia:</strong> NSAIDs (e.g., Diclofenac IM/PR) are first-line and often superior to opioids for biliary colic. <strong>Dietary advice:</strong> Low fat diet to reduce CCK stimulation and frequency of attacks. <br><br><h3>Surgical</h3><strong>Elective Laparoscopic Cholecystectomy:</strong> Recommended for symptomatic patients to prevent future complications (Acute Cholecystitis, Pancreatitis, Cholangitis). <br><strong>Medical Dissolution:</strong> Ursodeoxycholic acid (rarely used, high recurrence, only for small cholesterol stones).",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Acute Cholecystitis:</strong> Impaction leads to inflammation.</li><li><strong>Choledocholithiasis:</strong> Stone migration to CBD (Jaundice/Cholangitis).</li><li><strong>Gallstone Pancreatitis:</strong> Stone blocking pancreatic duct.</li><li><strong>Gallstone Ileus:</strong> Fistula to bowel causing obstruction.</li><li><strong>Mucocele of GB:</strong> Chronic obstruction with mucus buildup.</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Bile Duct Injury (0.3%):</strong> Risk increases with difficult anatomy.</li><li><strong>Bleeding:</strong> Cystic artery or liver bed.</li><li><strong>Infection:</strong> Wound infection or abscess.</li><li><strong>Diarrhea:</strong> Post-cholecystectomy bile salt diarrhea (10%).</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Saint's Triad</div>The \"unlucky\" triad of three common conditions often found together in elderly patients: <strong>Gallstones + Diverticulosis + Hiatus Hernia</strong>.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Mercedes Benz Sign</div>Gas within a gallstone (fissures) seen on CT/X-ray. Indicates nitrogen gas accumulation within the stone.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Asymptomatic Gallstones</div>Do NOT require surgery (except in Porcelain GB, sickle cell, or transplant candidates). Risk of complications is low (1-2%/year).</div>"
    },
    {
        "id": "pancreatitis",
        "category": "Hepatobiliary",
        "name": "Acute Pancreatitis",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Does the pain go straight through to your back?\" (Transfixion)</li><li>\"Does sitting forward make the pain easier?\" (Tripod position relieves retroperitoneal stretch)</li><li>\"Do you drink alcohol? How much?\"</li><li>\"Do you have a history of gallstones?\"</li><li>\"Any recent ERCP or trauma?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Perforated Peptic Ulcer:</strong> Air under diaphragm on CXR, history of NSAIDs.</li><li><strong>Acute Cholecystitis:</strong> RUQ pain, Murphy's positive.</li><li><strong>Myocardial Infarction:</strong> Inferior MI can present as epigastric pain (always do ECG).</li><li><strong>Ruptured AAA:</strong> Pulsatile mass, shock, history of vascular disease.</li><li><strong>Mesenteric Ischemia:</strong> Pain out of proportion to physical signs.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Pain:</strong> Sudden onset, severe, constant abdominal pain in the upper belly (epigastric) that radiates to the back or shoulders (\"boring\" pain). Pain reaches peak intensity quickly. <br><strong>Relieving Factors:</strong> Sitting forward or curling up (relieves tension on the retroperitoneum). <br><strong>Associated Symptoms:</strong> Nausea and profuse vomiting (vomiting does not relieve pain), fever, and a fast heartbeat (tachycardia). <br><br><h3>Causes (GET SMASHED)</h3><ul class=\"vertical-list\"><li><strong>G</strong>allstones (50% - Commonest)</li><li><strong>E</strong>thanol (30% - Alcohol)</li><li><strong>T</strong>rauma</li><li><strong>S</strong>teroids</li><li><strong>M</strong>umps / Malignancy</li><li><strong>A</strong>utoimmune (IgG4)</li><li><strong>S</strong>corpion sting</li><li><strong>H</strong>ypercalcemia / Hyperlipidemia</li><li><strong>E</strong>RCP (Iatrogenic)</li><li><strong>D</strong>rugs (Azathioprine, Thiazides, Valproate)</li></ul>",
        "physiology": "<h3>Pathophysiology</h3>1. <strong>Trigger:</strong> Injury to acinar cells (stones blocking duct or alcohol toxicity). <br>2. <strong>Activation:</strong> Premature activation of trypsinogen to trypsin <em>within</em> the pancreas. <br>3. <strong>Autodigestion:</strong> Trypsin activates other enzymes (elastase, phospholipase) leading to digestion of pancreatic tissue and fat necrosis. <br>4. <strong>Inflammation:</strong> Massive release of inflammatory mediators (Cytokines, Bradykinin) -> Systemic Inflammatory Response Syndrome (SIRS). <br>5. <strong>Systemic Effects:</strong> Capillary leak, vasodilation, shock, ARDS, renal failure. <br><br><strong>Phases:</strong> <br>- Early (<1 week): Systemic/Organ failure predominant. <br>- Late (>1 week): Local complications (Necrosis/Infection) predominant.",
        "exam": "<h3>General Inspection</h3>The patient looks unwell, dehydrated (dry tongue, poor turgor), and may be in shock (Tachycardia, Hypotension). Tachypnea is common (ARDS risk). Jaundice may be present if gallstone obstruction occurs. <br><br><h3>Abdominal Examination</h3><strong>Tenderness:</strong> Marked epigastric tenderness and guarding. The abdomen may feel rigid. <strong>Bowel Sounds:</strong> Reduced or absent (Paralytic Ileus due to retroperitoneal inflammation). <br><br><strong>Red Flags (Late/Severe):</strong> <br>- <strong>Cullen's Sign:</strong> Periumbilical bruising (hemoperitoneum tracking via falciform ligament). <br>- <strong>Grey Turner's Sign:</strong> Flank bruising (retroperitoneal hemorrhage). <br>Both indicate severe necrotizing pancreatitis with high mortality.",
        "inv": "<h3>Laboratory</h3><strong>Serum Amylase:</strong> >3x Upper Limit of Normal. Non-specific (can be raised in perforation/infarction). Rises fast, falls fast (normal within 48-72h). <br><strong>Serum Lipase:</strong> >3x Upper Limit of Normal. More specific and stays elevated longer (7-14 days). Preferred test. <br><strong>ABG:</strong> Check for Metabolic Acidosis, Hypoxia (ARDS), Lactate. <br><strong>Calcium:</strong> Hypocalcemia (Fat saponification binds calcium - poor prognostic sign). <br><strong>LFTs:</strong> ALT >150 suggests Gallstone etiology. <br><br><h3>Imaging</h3><strong>USG Abdomen (First Line):</strong> Essential to rule out gallstones/biliary dilation. Pancreas often obscured by gas. <br><strong>CT Pancreas (Contrast):</strong> <strong>CONTRAINDICATED for initial diagnosis</strong> (can be normal early on). Indicated after 48-72 hours to assess extent of necrosis or if diagnosis is unclear. <br><strong>MRCP:</strong> If CBD stone suspected but not seen on USG.",
        "mgmt": "<h3>Resuscitation (Mainstay)</h3><strong>Aggressive IV Fluids:</strong> (Hartmann's 250-500ml/hr) guided by urine output (>0.5ml/kg/hr) to maintain pancreatic perfusion and prevent necrosis. <br><strong>Analgesia:</strong> IV Opioids (Morphine/Fentanyl). Avoid NSAIDs in renal risk. <br><strong>Oxygen:</strong> Maintain sats >95%. <br><br><h3>Nutrition & Medical</h3><strong>Nutrition:</strong> Early enteral feeding (NG/NJ tube) is preferred over NBM (preserves gut mucosal barrier, reduces bacterial translocation and sepsis). TPN only if enteral fails. <br><strong>Antibiotics:</strong> NOT routine. Used only if infection is proven (e.g. infected necrosis) or strong clinical suspicion of sepsis. <br><br><h3>Specific</h3><strong>ERCP:</strong> Urgent (<24h) if cholangitis or biliary obstruction is present. <br><strong>Cholecystectomy:</strong> Performed within the same admission (usually before discharge) for mild gallstone pancreatitis to prevent recurrence.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological Progression</span><ul><li><strong>Systemic (Early):</strong> Shock, ARDS, Acute Renal Failure (MODS), DIC, Hypocalcemia, Hyperglycemia.</li><li><strong>Local (Late >4 weeks):</strong> <br>- <strong>Pseudocyst:</strong> Fluid collection with non-epithelial wall. <br>- <strong>Walled-off Necrosis (WON):</strong> Encapsulated necrotic tissue. <br>- <strong>Abscess:</strong> Infected collection. <br>- <strong>Pseudoaneurysm:</strong> Erosion into vessels (Splenic artery).</li><li><strong>Chronic:</strong> Diabetes (Endocrine failure), Steatorrhea (Exocrine failure).</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>ERCP Pancreatitis:</strong> Risk is 5%.</li><li><strong>Bleeding:</strong> From necrosis debridement.</li><li><strong>Fistula:</strong> Pancreaticocutaneous fistula post-drainage.</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Glasgow Imrie Score (PANCREAS)</div>Mnemonic to assess severity within 48h:<br><strong>P</strong>aO2 <8kPa<br><strong>A</strong>ge >55<br><strong>N</strong>eutrophils >15<br><strong>C</strong>alcium <2<br><strong>R</strong>enal (Urea) >16<br><strong>E</strong>nzymes (LDH) >600<br><strong>A</strong>lbumin <32<br><strong>S</strong>ugar >10<br>Score ≥3 = Severe Pancreatitis (ICU admission).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Revised Atlanta Classification</div><strong>Mild:</strong> No organ failure, no local complications. <br><strong>Moderate:</strong> Transient organ failure (<48h) OR local complications. <br><strong>Severe:</strong> Persistent organ failure (>48h).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Pancreatic Divisum</div>Most common congenital anomaly of the pancreas (failure of fusion of dorsal and ventral ducts). Can predispose to recurrent pancreatitis.</div>"
    },
    {
        "id": "hcc",
        "category": "Hepatobiliary",
        "name": "Hepatocellular Carcinoma",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Do you have Hepatitis B or C?\"</li><li>\"Do you drink alcohol heavily?\"</li><li>\"Did your belly swell up recently?\" (Decompensation)</li><li>\"Have you lost weight without trying?\"</li><li>\"Any family history of liver cancer?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Liver Metastasis:</strong> More common than primary HCC (look for primary in Colon, Breast, Lung).</li><li><strong>Cirrhosis (Decompensated):</strong> Without tumor.</li><li><strong>Hemangioma:</strong> Benign, incidental finding.</li><li><strong>Focal Nodular Hyperplasia.</strong></li><li><strong>Cholangiocarcinoma.</strong></li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3>Often asymptomatic until late stages. The patient may present with vague RUQ pain, weight loss, or <strong>sudden decompensation</strong> of known cirrhosis (e.g., new onset ascites, jaundice, encephalopathy, or variceal bleeding). <br><strong>Constitutional:</strong> Anorexia, weakness, fever. <br><strong>Risk Factors:</strong> Cirrhosis (Alcohol/NASH), Hepatitis B Carrier (can cause HCC without cirrhosis), Hepatitis C, Aflatoxin exposure (Aspergillus in grains), Hemochromatosis, Wilson's Disease.",
        "etiology": "<h3>Pathophysiology</h3>Primary malignancy of the hepatocyte. Usually arises in a cirrhotic liver due to chronic inflammation and regeneration (Regenerative nodules -> Dysplastic nodules -> HCC). <br><strong>Carcinogenesis:</strong> Integration of viral DNA (Hep B) or chronic inflammation (Hep C/Alcohol) leads to p53 mutations and uncontrolled proliferation.",
        "exam": "<h3>Signs</h3><strong>Liver:</strong> Hepatomegaly (hard, craggy, irregular border). An arterial bruit may be heard over the liver (due to high vascularity). <br><strong>Stigmata of Chronic Liver Disease:</strong> Spider naevi, Palmar erythema, Gynecomastia, Caput medusae, Dupuytren's contracture, Parotid swelling, Testicular atrophy. <br><strong>Decompensation:</strong> Ascites, Jaundice, Asterixis (flapping tremor), Fetor hepaticus.",
        "inv": "<h3>Laboratory</h3><strong>Alpha-fetoprotein (AFP):</strong> Tumor marker. >400 ng/ml is diagnostic in the appropriate radiological context. <br><strong>LFTs:</strong> Cirrhotic pattern (Low Albumin, High INR, High Bilirubin). <br><strong>Hepatitis Screen:</strong> HBsAg, Anti-HCV. <br><br><h3>Imaging</h3><strong>Multiphasic CT/MRI Liver (Diagnostic):</strong> The hallmark diagnostic pattern is <strong>Arterial phase enhancement</strong> (tumor lights up due to hepatic artery supply) followed by <strong>Venous phase washout</strong> (tumor becomes darker than liver as liver takes up contrast via portal vein). <br><strong>Biopsy:</strong> Often NOT needed if these radiological criteria are met in a cirrhotic liver (risk of tumor seeding along needle track).",
        "mgmt": "<h3>Curative Options</h3><strong>Resection (Hepatectomy):</strong> Only possible if the patient has a non-cirrhotic liver or very good liver function (Child-Pugh A) and no portal hypertension. <br><strong>Transplant:</strong> The best option for cirrhotic patients meeting <strong>Milan Criteria</strong> (Single lesion <5cm OR up to 3 lesions each <3cm, no vascular invasion/mets). Cures both the cancer and the cirrhosis. <br><br><h3>Locoregional Therapies</h3><strong>RFA (Radiofrequency Ablation):</strong> Curative for small tumors (<3cm). <strong>TACE (Transarterial Chemoembolization):</strong> For intermediate stage. Blocks blood supply and delivers chemo. <br><br><h3>Systemic Palliative</h3><strong>Sorafenib / Lenvatinib:</strong> Tyrosine kinase inhibitors for advanced disease. <strong>Immunotherapy:</strong> Atezolizumab + Bevacizumab is now first line.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Tumor Rupture:</strong> Causes acute hemoperitoneum and shock.</li><li><strong>Portal Vein Thrombosis:</strong> Tumor invades the vein, worsening portal hypertension.</li><li><strong>Liver Failure:</strong> Hepatic encephalopathy, coagulopathy.</li><li><strong>Variceal Bleeding:</strong> Due to portal hypertension.</li><li><strong>Metastasis:</strong> Lung, bone.</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Post-hepatectomy Liver Failure:</strong> Small remnant liver syndrome.</li><li><strong>Bile Leak.</strong></li><li><strong>Rejection (Transplant).</strong></li><li><strong>Post-embolization syndrome:</strong> Fever/pain after TACE.</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Child-Pugh Score</div>Assessment of prognosis in cirrhosis. Mnemonic \"Pour Another Beer At Eleven\":<br><strong>P</strong>T (INR)<br><strong>A</strong>scites<br><strong>B</strong>ilirubin<br><strong>A</strong>lbumin<br><strong>E</strong>ncephalopathy<br>Class A/B/C determines surgical fitness.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Surveillance</div>Cirrhotic patients should undergo USG Liver + AFP every 6 months to detect HCC early.</div>"
    },
    {
        "id": "hernia",
        "category": "General/Endocrine",
        "name": "Groin Hernias",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Does the lump disappear when you lie down?\" (Reducibility)</li><li>\"Is it painful? Can you push it back in?\" (Irreducible = Incarcerated)</li><li>\"Do you do heavy lifting or have a chronic cough?\" (Risk Factors)</li><li>\"Any vomiting or abdominal distension?\" (Obstruction)</li><li>\"Have you had a hernia repair before?\" (Recurrence)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Hydrocele:</strong> Transilluminates, possible to get above it.</li><li><strong>Inguinal Lymph Node:</strong> Firm, multiple, infection elsewhere.</li><li><strong>Femoral Artery Aneurysm:</strong> Pulsatile.</li><li><strong>Saphena Varix:</strong> Soft, compressible, thrill on cough.</li><li><strong>Psoas Abscess:</strong> Pointing to groin, fever, spine signs.</li></ul></div>",
        "history": "<h3>Clinical Presentation</h3><strong>Lump:</strong> Swelling in the groin. <strong>Reducibility:</strong> Lump appears when standing, coughing, or straining. Disappears when lying down or can be pushed back manually. <strong>Symptoms:</strong> Dragging sensation, aching pain, or asymptomatic. <br><br><strong>Complications (Red Flags):</strong> <br>1. <strong>Incarceration:</strong> Painful, irreducible lump. <br>2. <strong>Strangulation:</strong> Sudden severe pain, nausea, vomiting, red/tender lump. Ischemic bowel. <strong>Surgical Emergency!</strong> <br>3. <strong>Obstruction:</strong> Colicky pain, distension, vomiting. <br><br><strong>Risk Factors:</strong> Raised Intra-abdominal Pressure (Chronic cough, Constipation, Heavy lifting, BPH/Straining). Obesity. Smoking (collagen defect). Age (weakness). Pregnancy.",
        "etiology": "<h3>Pathophysiology</h3>Protrusion of a viscus (bowel/omentum) through a defect in the abdominal wall. <br><strong>Indirect Inguinal:</strong> Through the Deep Ring. Congenital patent processus vaginalis. Travels inside the spermatic cord. <br><strong>Direct Inguinal:</strong> Through Hesselbach's Triangle (Posterior wall weakness/Fascia Transversalis). Medial to inferior epigastric vessels. <br><strong>Femoral:</strong> Through the Femoral Canal (below inguinal ligament). High risk of strangulation due to narrow neck (lacunar ligament).",
        "exam": "<h3>Examination Steps</h3><strong>Inspection:</strong> Site, size, skin changes. Visible cough impulse. <br><strong>Palpation:</strong> <br>- <strong>Get above the swelling?</strong> Yes = Scrotal lump; No = Hernia. <br>- <strong>Cough Impulse:</strong> Expansile impulse on coughing. <br>- <strong>Reducibility:</strong> Ask patient to reduce it. <br><br><strong>Anatomical Landmarks:</strong> <br>- <strong>Inguinal:</strong> Above and medial to the pubic tubercle. <br>- <strong>Femoral:</strong> Below and lateral to the pubic tubercle. <br><br><strong>Deep Ring Occlusion Test:</strong> Reduce hernia, occlude deep ring (midpoint of inguinal ligament), ask patient to cough. <br>- If restrained = Indirect (controlled at deep ring). <br>- If appears medial to finger = Direct (pushes through posterior wall).",
        "inv": "<h3>Diagnostic</h3><strong>Clinical Diagnosis:</strong> Usually sufficient. <br><strong>Ultrasound Groin:</strong> If diagnostic uncertainty (e.g., distinguishing small hernia vs lymph node vs lipoma vs hydrocele). <br><strong>CT Abdomen:</strong> Indicated if strangulation or bowel obstruction is suspected to assess bowel viability.",
        "mgmt": "<h3>Conservative</h3><strong>Watchful Waiting:</strong> Recommended for small, asymptomatic (or minimally symptomatic) inguinal hernias in men. Risk of strangulation is low. <br><strong>Supportive Truss:</strong> Can provide symptomatic relief if the patient is unfit for surgery. <br><br><h3>Surgical (Hernia Repair)</h3><strong>Indications:</strong> Symptomatic, getting bigger, femoral hernia (always fix due to high risk), or complications. <br><strong>Open Repair (Lichtenstein):</strong> Anterior approach. Tension-free repair using Mesh reinforcement (Hernioplasty). Reduces recurrence. <br><strong>Minimally Invasive (Laparoscopic/Robotic):</strong> TEP (Totally Extraperitoneal) or TAPP (Transabdominal Preperitoneal). Preferred for bilateral hernias, recurrent hernias, and quicker recovery. <br><strong>Emergency Surgery:</strong> Required for Strangulation. Resection of non-viable bowel + repair (often without mesh in infected field).",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Incarceration:</strong> Irreducible but viable.</li><li><strong>Strangulation:</strong> Ischemic necrosis. Gangrene. Perforation.</li><li><strong>Bowel Obstruction.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Recurrence:</strong> <1% with mesh.</li><li><strong>Chronic Groin Pain:</strong> Ilioinguinal nerve entrapment.</li><li><strong>Ischemic Orchitis:</strong> Testicular artery injury.</li><li><strong>Mesh Infection.</strong></li><li><strong>Urinary Retention.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Richter's Hernia</div>Only one wall of the bowel (antimesenteric border) herniates. It can strangulate and necrose <em>without</em> causing total bowel obstruction signs. Very dangerous and deceptive.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Pantaloon Hernia</div>A combined direct and indirect inguinal hernia on the same side (straddling the inferior epigastric vessels like a pair of trousers).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Hesselbach's Triangle Boundaries</div>Medial: Rectus abdominis. Lateral: Inferior epigastric vessels. Inferior: Inguinal ligament. Site of Direct Hernias.</div>"
    },
    {
        "id": "ugib",
        "category": "Upper GI",
        "name": "Upper GI Bleeding",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Is the vomit bright red or coffee grounds?\" (Active vs Old)</li><li>\"Is stool black and tarry?\" (Melaena - ask about distinct foul smell)</li><li>\"History of Liver disease/Alcohol?\" (Varices)</li><li>\"Do you take NSAIDs/Aspirin/Blood thinners?\"</li><li>\"Do you feel dizzy when standing?\" (Postural hypotension - Significant loss)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Peptic Ulcer Disease:</strong> 50% of cases.</li><li><strong>Esophageal Varices:</strong> Stigmata of liver disease, massive bleed.</li><li><strong>Mallory-Weiss Tear:</strong> History of forceful retching.</li><li><strong>Gastric Cancer:</strong> Weight loss, cachexia, early satiety.</li><li><strong>Dieulafoy's Lesion:</strong> Massive painless bleed from submucosal artery.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Hematemesis:</strong> Vomiting fresh blood (active bleed) or \"coffee-ground\" material (altered blood). <br><strong>Melaena:</strong> Black, tarry, foul-smelling stool (digested blood). <br><strong>Symptoms of Anemia:</strong> Dizziness, palpitations, syncope, angina (indicates >15% blood loss). <br><strong>Risk Factors:</strong> H. pylori, NSAIDs/Steroids/Anticoagulants, Alcohol, Smoking, Previous UGIB, Liver Disease.",
        "etiology": "<h3>Pathophysiology</h3>Bleeding originating proximal to the Ligament of Treitz. Acid and pepsin digest the blood, converting Hemoglobin to Hematin (black color) and increasing absorption of nitrogenous products (raising Urea). <br><strong>Variceal:</strong> Portal hypertension opens porto-systemic shunts. Rupture causes massive hemorrhage. <br><strong>Non-Variceal:</strong> Erosion of vessels by acid/pepsin (Ulcer) or mechanical tear (Mallory-Weiss).",
        "exam": "<h3>Hemodynamics</h3>Assess for Shock: Tachycardia, Hypotension, Cool peripheries. Capillary refill time. Postural drop in BP >20mmHg. <br><h3>Stigmata of Chronic Liver Disease</h3>Jaundice, Spider Naevi, Palmar Erythema, Ascites, Caput Medusae, Splenomegaly (Suggests Portal Hypertension/Variceal bleed). <br><h3>PR Exam</h3>Mandatory. Confirm melaena vs fresh blood (exclude hemorrhoids/LGIB).",
        "inv": "<h3>Laboratory</h3><strong>FBC:</strong> Low Hb (may be normal initially due to hemoconcentration - lag). Low Platelets (Liver disease/Hypersplenism). <strong>Urea:</strong> Elevated disproportionate to Creatinine (due to protein meal from blood digestion). <strong>Coagulation (INR):</strong> Deranged in liver disease/warfarin. <strong>GXM:</strong> Group and Crossmatch 4-6 units. <br><h3>Procedural</h3><strong>OGDS (Endoscopy):</strong> Diagnostic and Therapeutic. Ideally performed within 24h of admission.",
        "mgmt": "<h3>Resuscitation (ABCs)</h3><strong>Airway:</strong> Protect if low GCS/massive hematemesis. <strong>Circulation:</strong> 2 Large Bore Cannulas (Grey 16G/Orange 14G). Fluid Resuscitation (Crystalloids). Blood Transfusion (Target Hb 7-9 g/dL; Massive Transfusion Protocol if unstable). Correct coagulopathy (FFP/Vitamin K/Platelets). <br><h3>Medical</h3><strong>IV PPI:</strong> High dose (80mg bolus + 8mg/hr infusion) AFTER endoscopy. <strong>Variceal Suspected:</strong> Terlipressin/Octreotide (Splanchnic vasoconstrictors) + Prophylactic Antibiotics (Ceftriaxone) immediately. <br><h3>Endoscopic Therapy</h3><strong>Non-Variceal (Ulcer):</strong> Dual therapy (Adrenaline injection + Thermal coagulation or Hemoclips). <strong>Variceal:</strong> Band Ligation (EVL) is gold standard. Sclerotherapy. <br><h3>Refractory Bleeding</h3><strong>Interventional Radiology:</strong> Angiography + Embolization. <strong>Sengstaken-Blakemore Tube:</strong> Balloon tamponade (temporary bridge). <strong>Surgery:</strong> Under-running the vessel or TIPS (Transjugular Intrahepatic Portosystemic Shunt).",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li>Hypovolemic Shock / Death.</li><li>Aspiration Pneumonia.</li><li>Re-bleeding.</li><li>Hepatic Encephalopathy (blood meal precipitates this).</li><li>Renal Failure (hypoperfusion).</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li>Endoscopic Perforation.</li><li>Transfusion Reaction.</li><li>Fluid Overload.</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Scores</div><strong>Glasgow-Blatchford Score:</strong> Uses Urea, Hb, BP, Pulse to risk stratify <em>before</em> endoscopy (Score 0 = Can discharge). <br><strong>Rockall Score:</strong> Calculates mortality risk <em>post-endoscopy</em> (Age, Shock, Comorbidity, Diagnosis, Stigmata). <br><strong>Forrest Classification:</strong> Grades ulcer re-bleeding risk (Ia Spurting -> III Clean base).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Dieulafoy's Lesion</div>A rare cause of massive GI bleed. It is an abnormally large artery that penetrates the gut wall and erodes through the mucosa, even without an ulcer.</div>"
    },
    {
        "id": "pud",
        "category": "Upper GI",
        "name": "Peptic Ulcer Disease",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Does eating food make the pain better (Duodenal) or worse (Gastric)?\"</li><li>\"Does the pain wake you up at night?\" (Hunger pain)</li><li>\"Do you take NSAIDs (Painkillers like Ibuprofen/Voltaren)?\"</li><li>\"Have you lost or gained weight?\"</li><li>\"Any black sticky stools?\" (Bleeding)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Non-Ulcer Dyspepsia (Functional):</strong> Diagnosis of exclusion.</li><li><strong>Gastric Cancer:</strong> Weight loss, early satiety, anemia.</li><li><strong>Gallstones:</strong> Colicky pain, relation to fatty food.</li><li><strong>Pancreatitis:</strong> Back radiation, severe pain.</li><li><strong>GERD:</strong> Retrosternal burning, water brash.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Pain:</strong> Epigastric burning pain (dyspepsia). <br><strong>Duodenal Ulcer (DU):</strong> Pain relieved by food (pylorus closes/buffer). \"Hunger pain\", wakes patient at night. Weight gain (eating to relieve pain). <br><strong>Gastric Ulcer (GU):</strong> Pain worsens with food (acid secretion). Patient avoids eating -> Weight loss, anorexia. <br><strong>Risk Factors:</strong> H. Pylori (90% DU, 70% GU), NSAIDs (Inhibit prostaglandins/mucosal protection), Smoking, Alcohol, Physiological Stress (Burns - Curling's / ICU - Cushing's).",
        "etiology": "<h3>Pathophysiology</h3>Imbalance between aggressive factors (Acid, Pepsin) and protective factors (Mucus, Bicarbonate, Prostaglandins, Blood flow). <br><strong>H. pylori:</strong> Urease production neutralizes acid, allowing colonization. Cytotoxins cause inflammation and mucosal damage. <br><strong>NSAIDs:</strong> Inhibit COX-1 -> reduced prostaglandins -> reduced mucus/bicarbonate secretion.",
        "exam": "<h3>Signs</h3>Often normal. <strong>Pointing Sign:</strong> Patient points to epigastrium with one finger. Epigastric tenderness. Check for signs of anemia (pallor) or complications (succussion splash in pyloric stenosis).",
        "inv": "<h3>Diagnosis</h3><strong>OGDS (Endoscopy):</strong> Visualize ulcer. <strong>Biopsy:</strong> Mandatory for Gastric ulcers to rule out cancer (DU rarely malignant). <br><strong>H. pylori Testing:</strong> CLO test (Rapid urease test during scope), Urea Breath Test, or Stool Antigen. Serology is less useful (stays positive).",
        "mgmt": "<h3>Medical</h3><strong>PPI (Omeprazole/Pantoprazole):</strong> Acid suppression. <br><strong>H. pylori Eradication (Triple Therapy):</strong> PPI + Clarithromycin + Amoxicillin (or Metronidazole) for 7-14 days. <br><strong>Lifestyle:</strong> Stop NSAIDs, Smoking cessation, Alcohol reduction. <br><h3>Surgical</h3>Rare nowadays due to PPIs. Indicated for complications (Perforation, Bleeding, Obstruction). <strong>Highly Selective Vagotomy</strong> or <strong>Partial Gastrectomy</strong> (Billroth I/II) for refractory cases.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Perforation:</strong> Peritonitis.</li><li><strong>Bleeding:</strong> Hematemesis/Melaena.</li><li><strong>Gastric Outlet Obstruction:</strong> Pyloric stenosis (hypochloremic metabolic alkalosis).</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Dumping Syndrome:</strong> Rapid emptying post-gastrectomy.</li><li><strong>Nutritional Deficiency:</strong> B12 (Intrinsic factor), Iron, Calcium.</li><li><strong>Afferent Loop Syndrome.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Zollinger-Ellison Syndrome</div>Caused by a Gastrinoma (gastrin-secreting tumor, usually in pancreas/duodenum). Results in massive acid production and multiple, refractory peptic ulcers in unusual locations (e.g. jejunum).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 H. Pylori Testing Rule</div>Patients must stop PPIs for 2 weeks before a Urea Breath Test or Stool Antigen test to avoid false negatives.</div>"
    },
    {
        "id": "perf_pud",
        "category": "Upper GI",
        "name": "Perforated PUD",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Did the pain start suddenly, like a clap of thunder?\"</li><li>\"Exactly what time did it start?\" (Patient knows exact minute)</li><li>\"History of ulcers or NSAID use?\"</li><li>\"Do you have pain in your shoulder tip?\" (Diaphragmatic irritation)</li><li>\"Have you vomited?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Acute Pancreatitis:</strong> High Amylase, no pneumoperitoneum.</li><li><strong>Ruptured AAA:</strong> Pulsatile mass, shock, back pain.</li><li><strong>Myocardial Infarction:</strong> ECG changes.</li><li><strong>Acute Appendicitis:</strong> Valentino's syndrome.</li><li><strong>Mesenteric Ischemia:</strong> Pain out of proportion to exam.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Pain:</strong> Sudden, abrupt onset of severe, generalized abdominal pain (\"Thunderclap\"). <br><strong>Progression:</strong> Initial chemical peritonitis (acid) -> Lucid interval (dilution by peritoneal fluid) -> Bacterial peritonitis (sepsis). <br><strong>The Classic Triad:</strong> 1. Sudden onset abdominal pain. 2. Tachycardia. 3. Abdominal Rigidity. <br><strong>Risk Factors:</strong> Chronic dyspepsia, NSAID use, Steroids, Smoking, Previous Peptic Ulcer.",
        "etiology": "<h3>Pathology</h3>Full thickness erosion of stomach/duodenal wall -> Spillage of acid, bile, and food contents into peritoneal cavity -> Chemical Peritonitis -> Bacterial Superinfection (Peritonitis).",
        "exam": "<h3>Inspection</h3>Patient lies perfectly still; breathing is shallow (diaphragmatic inhibition). Signs of shock (pallor, sweating). <br><h3>Palpation</h3><strong>\"Board-like\" Rigidity:</strong> Involuntary guarding of the entire abdomen. Tenderness is generalized, maximal in epigastrium initially. <strong>Rebound Tenderness:</strong> Positive (indicates Peritonitis). <br><h3>Percussion & Auscultation</h3><strong>Liver Dullness:</strong> Obliterated (replaced by resonance due to free gas under diaphragm). <strong>Bowel Sounds:</strong> Absent (silent abdomen).",
        "inv": "<h3>Imaging</h3><strong>Erect Chest X-Ray (CXR):</strong> Shows free gas under the diaphragm (Pneumoperitoneum) - seen in 70% of cases. <br><strong>CT Abdomen:</strong> High sensitivity. Shows free air, fluid, and leak site. <br><h3>Labs</h3><strong>Amylase:</strong> May be mildly elevated (rule out Pancreatitis). <strong>Lactate:</strong> Elevated in sepsis/ischemia. <strong>FBC:</strong> Leukocytosis.",
        "mgmt": "<h3>Resuscitation (Immediate)</h3><strong>ABCDE Approach:</strong> 2 large bore IV lines. <strong>Fluids:</strong> Crystalloids to restore BP. <strong>Nasogastric Tube:</strong> For decompression. <strong>Foley Catheter:</strong> Monitor urine output. <strong>Medications:</strong> IV Broad-spectrum Antibiotics, IV PPI (Pantoprazole), IV Analgesia. <br><h3>Surgical Repair</h3><strong>Laparotomy or Laparoscopy:</strong> Identification of perforation. <strong>Graham Patch Repair:</strong> Plugging the hole with a piece of omentum and suturing it. <strong>Peritoneal Toilet:</strong> Thorough washout of the abdominal cavity. <br><h3>Conservative (Taylor Approach)</h3>Rarely used. Only for stable patients with sealed perforation (confirmed on contrast study).",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Sepsis/Septic Shock:</strong> High mortality.</li><li><strong>Intra-abdominal Abscess:</strong> Subphrenic/Pelvic.</li><li><strong>Enterocutaneous Fistula:</strong> Leakage to skin.</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Wound Dehiscence:</strong> Burst abdomen.</li><li><strong>Paralytic Ileus.</strong></li><li><strong>Leak from repair.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Valentino's Syndrome</div>Gastric contents tracking down the right paracolic gutter to the RIF, mimicking appendicitis.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Rigler's Sign</div>On abdominal X-ray, seeing both the inner and outer wall of the bowel (air on both sides). Indicates massive pneumoperitoneum.</div>"
    },
    {
        "id": "eso_gastric_ca",
        "category": "Upper GI",
        "name": "Esophageal & Gastric Ca",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Is food getting stuck? Solids first then liquids?\" (Progressive mechanical obstruction)</li><li>\"Have you lost a lot of weight recently?\"</li><li>\"Do you have a history of heartburn/reflux?\"</li><li>\"Any vomiting or regurgitation?\"</li><li>\"Is there pain on swallowing?\" (Odynophagia)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Achalasia:</strong> Dysphagia to liquids & solids same time.</li><li><strong>Peptic Stricture:</strong> Long hx of GERD.</li><li><strong>Pharyngeal Pouch:</strong> Halitosis, regurgitation.</li><li><strong>Stroke/Neurological:</strong> Choking, spluttering.</li><li><strong>Esophageal Web:</strong> Plummer-Vinson syndrome.</li></ul></div>",
        "history": "<h3>Esophageal Ca Symptoms</h3><strong>Progressive Dysphagia:</strong> First to solids (\"meat sticking\"), then soft foods, then liquids. <strong>Weight Loss:</strong> Significant and rapid. <strong>Regurgitation/Vomiting.</strong> <strong>Odynophagia:</strong> Pain on swallowing (ulceration/invasion). <strong>Hoarseness:</strong> Recurrent Laryngeal Nerve involvement. <br><h3>Gastric Ca Symptoms</h3><strong>Dyspepsia:</strong> Unresponsive to PPI. <strong>Early Satiety:</strong> Feeling full quickly (Linitis Plastica). <strong>Epigastric Pain.</strong> <strong>Weight Loss/Anorexia.</strong> Vomiting (Pyloric obstruction). <br><strong>Risk Factors:</strong> <br>- <strong>Squamous Cell:</strong> Smoking, Alcohol, Nitrosamines. <br>- <strong>Adenocarcinoma:</strong> GERD, Barrett's Esophagus, Obesity. <br>- <strong>Gastric:</strong> H. Pylori, High salt diet, Smoking, Pernicious anemia, Blood group A.",
        "etiology": "<h3>Pathology</h3><strong>Esophagus:</strong> <br>- Squamous Cell Carcinoma (Upper/Mid esophagus). <br>- Adenocarcinoma (Lower 1/3, associated with Barrett's metaplasia). <br><strong>Stomach:</strong> <br>- Adenocarcinoma (95%). <br>- <strong>Intestinal Type:</strong> Exophytic mass. <br>- <strong>Diffuse Type:</strong> Infiltrative (Linitis Plastica), Signet Ring Cells.",
        "exam": "<h3>Signs of Metastasis</h3><strong>Virchow's Node:</strong> Left supraclavicular node (Troisier's sign). <strong>Sister Mary Joseph Nodule:</strong> Umbilical nodule. <strong>Hepatomegaly:</strong> Liver mets. <strong>Epigastric Mass.</strong> Cachexia/Anemia (Pallor).",
        "inv": "<h3>Diagnosis</h3><strong>OGDS (Endoscopy) + Biopsy:</strong> Definitive diagnosis. <br><h3>Staging</h3><strong>CT Thorax/Abdomen:</strong> Metastases (Liver/Lung) and local invasion. <br><strong>Endoscopic Ultrasound (EUS):</strong> Best for T-staging (depth of invasion) and N-staging (local nodes). <br><strong>PET Scan:</strong> Distant occult mets. <br><strong>Diagnostic Laparoscopy:</strong> To check for peritoneal seeding (Gastric Ca).",
        "mgmt": "<h3>Esophageal Management</h3><strong>Surgery:</strong> Esophagectomy (Ivor-Lewis procedure - Two phase, abdominal and thoracic). <br><strong>Neoadjuvant:</strong> Chemo/Radiotherapy usually given first (CROSS trial data) to downstage tumor. <br><strong>Palliative:</strong> Esophageal Stent (for dysphagia). <br><h3>Gastric Management</h3><strong>Surgery:</strong> Total or Subtotal Gastrectomy with D2 Lymphadenectomy. <br><strong>Chemotherapy:</strong> Peri-operative (MAGIC protocol / FLOT regimen).",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Tracheo-esophageal Fistula:</strong> Coughing on swallowing.</li><li><strong>Aspiration Pneumonia.</strong></li><li><strong>Malnutrition/Cachexia.</strong></li><li><strong>Bleeding:</strong> Hematemesis.</li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Anastomotic Leak:</strong> High mortality.</li><li><strong>Chylothorax:</strong> Thoracic duct injury.</li><li><strong>Dumping Syndrome.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Barrett's Esophagus</div>Metaplasia of the lower esophagus from Squamous to Columnar epithelium due to chronic acid reflux. It is a precursor to <strong>Adenocarcinoma</strong>. Requires surveillance endoscopy.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Krukenberg Tumor</div>A metastatic tumor to the ovary that originated from the stomach (histology shows signet ring cells).</div>"
    },
    {
        "id": "cholangio",
        "category": "Hepatobiliary",
        "name": "Cholangiocarcinoma",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Are you jaundiced (yellow)?\"</li><li>\"Do you have Ulcerative Colitis?\" (PSC link)</li><li>\"History of liver flukes?\" (Travel/Asian ethnicity)</li><li>\"Is your skin itchy?\" (Pruritus)</li><li>\"Have you lost weight?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Pancreatic Cancer:</strong> Similar painless jaundice.</li><li><strong>Choledocholithiasis:</strong> Painful jaundice.</li><li><strong>Primary Sclerosing Cholangitis (PSC):</strong> Strictures.</li><li><strong>Primary Biliary Cholangitis (PBC):</strong> Anti-mitochondrial Ab.</li><li><strong>Mirizzi Syndrome.</strong></li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3>Presentation depends on location. <br><strong>Extrahepatic:</strong> Painless obstructive jaundice, pruritus, pale stools, dark urine. <br><strong>Intrahepatic:</strong> Vague RUQ pain, weight loss, mass (late jaundice). <br><strong>Risk Factors:</strong> Primary Sclerosing Cholangitis (PSC - strongly linked to Ulcerative Colitis), Choledochal cysts, Liver Flukes (<em>Clonorchis sinensis</em>, <em>Opisthorchis viverrini</em>), Hepatitis B/C, Hepatolithiasis.",
        "etiology": "<h3>Pathology</h3>Adenocarcinoma arising from the epithelial cells of the bile ducts. <br><strong>Classification (Anatomic):</strong> <br>1. Intrahepatic (10%). <br>2. Perihilar/Klatskin (50%) - Junction of Right and Left hepatic ducts. <br>3. Distal (40%).",
        "exam": "<h3>Signs</h3>Deep Jaundice. Hepatomegaly. Scratch marks. <br><strong>Gallbladder:</strong> <br>- If tumor is <strong>Distal</strong> (below cystic duct): Palpable GB (Courvoisier's sign positive). <br>- If tumor is <strong>Hilar/Klatskin</strong> (above cystic duct): Non-palpable/Collapsed GB.",
        "inv": "<h3>Labs</h3>Cholestatic LFTs. <strong>Tumor Markers:</strong> CA 19-9 (Elevated in ~80%), CEA. IgG4 (rule out autoimmune cholangiopathy). <br><h3>Imaging</h3><strong>MRCP:</strong> Investigation of choice for biliary tree mapping. <br><strong>CT Abdomen:</strong> For staging and vascular involvement. <br><strong>ERCP:</strong> Diagnostic (brushings for cytology - often low sensitivity) and Therapeutic (stenting).",
        "mgmt": "<h3>Surgical (Only curative option)</h3><strong>Distal Tumors:</strong> Whipple's Procedure (Pancreaticoduodenectomy). <br><strong>Hilar (Klatskin) Tumors:</strong> Major Hepatectomy + Caudate lobectomy + Roux-en-Y Hepaticojejunostomy. <br><strong>Intrahepatic:</strong> Hepatic resection. <br><h3>Palliative & Other Treatments</h3><strong>Biliary Drainage:</strong> Involves placing a tube into the bile duct (via ERCP or Percutaneous Transhepatic route - PTC) to relieve obstruction and jaundice. <br><strong>Radiofrequency Ablation (RFA):</strong> Uses electric current to heat and destroy cancer cells (for unresectable tumors). <br><strong>Chemotherapy:</strong> Gemcitabine + Cisplatin. <br><strong>Clinical Trials:</strong> New treatments are often tested for unresectable cases.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Cholangitis:</strong> Sepsis from biliary stasis.</li><li><strong>Liver Failure:</strong> Biliary cirrhosis.</li><li><strong>Metastasis.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Bile Leak.</strong></li><li><strong>Hepatic Insufficiency.</strong></li><li><strong>Stent Blockage:</strong> Recurrent jaundice.</li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Klatskin Tumor</div>Perihilar cholangiocarcinoma located at the junction of the right and left hepatic ducts. They cause jaundice but a <strong>collapsed gallbladder</strong> (below the obstruction).</div>"
    },
    {
        "id": "gb_ca",
        "category": "Hepatobiliary",
        "name": "Gallbladder Carcinoma",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Do you have a long history of gallstones?\"</li><li>\"Have you had constant RUQ pain and weight loss?\"</li><li>\"Are you jaundiced?\"</li><li>\"Loss of appetite?\"</li><li>\"Can you feel a lump?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Chronic Cholecystitis:</strong> Similar pain but no mass/weight loss.</li><li><strong>Xanthogranulomatous Cholecystitis:</strong> Mimics cancer on CT.</li><li><strong>Empyema GB:</strong> Fever, sepsis.</li><li><strong>Mirizzi Syndrome:</strong> Jaundice.</li><li><strong>Liver Metastasis.</strong></li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Incidental:</strong> Often found incidentally during Cholecystectomy for gallstones (1% of cases). <br><strong>Symptomatic (Advanced):</strong> Persistent RUQ pain (mimics chronic cholecystitis but unremitting), weight loss, anorexia, nausea. <br><strong>Jaundice:</strong> Indicates biliary tree invasion (poor prognosis). <br><strong>Risk Factors:</strong> Gallstones (present in 80%), <strong>Porcelain Gallbladder</strong> (calcified wall), Gallbladder Polyps >1cm, Chronic <em>Salmonella typhi</em> carrier, Anomalous pancreaticobiliary junction.",
        "etiology": "<h3>Pathology</h3>Chronic inflammation -> Metaplasia -> Dysplasia -> Carcinoma. Adenocarcinoma (90%). Spread is direct to liver (segments IVb/V) and lymphatics.",
        "exam": "<h3>Signs</h3>Often unremarkable in early stages. <br><strong>Advanced:</strong> Hard, irregular RUQ Mass. Jaundice (if CBD obstruction occurs). Virchow's Node (Supraclavicular lymphadenopathy - metastasis).",
        "inv": "<h3>Imaging</h3><strong>Ultrasound:</strong> Mass replacing the gallbladder, or focal wall thickening >3mm/irregularity. <br><strong>CT/MRI:</strong> For staging, liver invasion (Segments IVb/V), and nodal spread. <br><h3>Tumor Markers</h3><strong>CEA</strong> and <strong>CA 19-9:</strong> Often elevated but non-specific.",
        "mgmt": "<h3>Surgical (Stage Dependent)</h3><strong>Simple Cholecystectomy:</strong> Curative for very early tumors confined to mucosa (Tis and T1a only). <br><strong>Extended Cholecystectomy:</strong> For muscle invasive disease (>T1b). Involves removal of the gallbladder, en-bloc resection of adjacent liver tissue (Segments IVb/V), and regional lymphadenectomy (portal hepatis nodes). <br><h3>Adjuvant & Palliative</h3><strong>Adjuvant Therapy:</strong> Chemotherapy (Gemcitabine/Cisplatin) +/- Radiation after surgery to prevent recurrence. <br><strong>Systemic Therapy:</strong> For unresectable/metastatic disease. <br><strong>Palliative:</strong> Biliary drainage (Stenting) if jaundiced.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Biliary Obstruction.</strong></li><li><strong>Duodenal Obstruction.</strong></li><li><strong>Liver Metastasis.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Bile Leak.</strong></li><li><strong>Bleeding from liver bed.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Porcelain Gallbladder</div>Calcification of the gallbladder wall due to chronic inflammation. Historically thought to have very high cancer risk (>20%), recent studies suggest risk is lower (~6%), but prophylactic cholecystectomy is still often recommended.</div>"
    },
    {
        "id": "stones",
        "category": "Urology",
        "name": "Renal Stones (Urolithiasis)",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Is the pain moving from your loin (back) to your groin?\"</li><li>\"Can you find a comfortable position?\" (No = Colic)</li><li>\"Any blood in urine?\"</li><li>\"Nausea/Vomiting?\"</li><li>\"Fever?\" (Sepsis)</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Appendicitis:</strong> Right sided, patient lies still.</li><li><strong>Ruptured AAA:</strong> Elderly, shock, pulsatile mass.</li><li><strong>Pyelonephritis:</strong> Fever, rigors, sepsis.</li><li><strong>Musculoskeletal Back Pain:</strong> Worse with movement.</li><li><strong>Biliary Colic:</strong> RUQ pain.</li></ul></div>",
        "history": "<h3>History of Presenting Illness</h3><strong>Renal Colic:</strong> Sudden, severe, fluctuating pain (\"Loin to Groin\"). Patient is restless, rolling around in bed (cannot get comfortable). Associated with Nausea, vomiting, hematuria, dysuria. <br><strong>Risk Factors:</strong> Dehydration, High salt/animal protein diet, Gout, Hyperparathyroidism, Family history. <br><strong>Stone Types:</strong> Calcium Oxalate (80%), Uric Acid (Radiolucent), Struvite (Infection), Cystine.",
        "etiology": "<h3>Pathogenesis</h3>Supersaturation of urine with solutes -> Nucleation of crystals -> Aggregation into stones. <br><strong>Sites of Obstruction:</strong> 1. PUJ (Pelvi-ureteric junction) 2. Crossing iliac vessels 3. VUJ (Vesico-ureteric junction - narrowest).",
        "exam": "<h3>Findings</h3><strong>Abdomen:</strong> Soft, non-tender anteriorly (retroperitoneal pathology). Tenderness in renal angle (CVA). <strong>Systemic:</strong> Fever indicates infected obstructed kidney (Urological Emergency!).",
        "inv": "<h3>Bedside</h3><strong>Urine Dipstick:</strong> +++ Blood. pH (Uric acid stones acidic). Nitrites (Infection). <br><h3>Labs</h3>Renal profile (Creatinine), Calcium, Uric Acid, CRP/WBC (Infection). <br><h3>Imaging</h3><strong>CT KUB (Non-contrast):</strong> Gold standard (Sensitivity 99%). Detects almost all stones (radiopaque & radiolucent) and hydronephrosis. <strong>X-Ray KUB:</strong> Only sees radiopaque stones (Calcium). Misses Uric acid stones.",
        "mgmt": "<h3>Acute Management</h3><strong>Analgesia:</strong> NSAIDs (Diclofenac IM/PR) are superior to opioids for colic (reduce glomerular pressure). Hydration. <strong>Medical Expulsive Therapy (MET):</strong> Tamsulosin (Alpha-blocker) for distal ureteric stones <10mm. <br><h3>Intervention Indications</h3>Stone >10mm, Failure of MET, Intractable pain, Single kidney, Infection. <br><h3>Procedures</h3><strong>ESWL (Shockwave Lithotripsy):</strong> Non-invasive. For renal stones <2cm. <strong>URS (Ureteroscopy):</strong> Laser fragmentation. For ureteric stones. <strong>PCNL (Percutaneous Nephrolithotomy):</strong> Keyhole surgery. For large renal stones (>2cm) or Staghorn calculi. <br><h3>Emergency Drainage</h3>If Infected + Obstructed Kidney -> Nephrostomy or DJ Stent insertion immediately.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Hydronephrosis.</strong></li><li><strong>Pyonephrosis:</strong> Pus in kidney (Sepsis).</li><li><strong>Renal Failure:</strong> If bilateral obstruction or solitary kidney.</li><li><strong>Stricture formation.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Bleeding:</strong> Especially PCNL.</li><li><strong>Ureteric Injury/Avulsion.</strong></li><li><strong>Sepsis post-manipulation.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Hounsfield Units (HU)</div>Used on CT to determine stone hardness. Uric acid stones are softer (~500 HU) and can sometimes be dissolved chemically. Calcium stones are harder (>1000 HU) and require lithotripsy/laser.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Struvite Stones</div>Infection stones caused by urea-splitting bacteria (e.g., <em>Proteus</em>). Forms \"Staghorn Calculi\" that fill the renal pelvis.</div>"
    },
    {
        "id": "bph",
        "category": "Urology",
        "name": "Benign Prostatic Hyperplasia",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Do you have to wait for the stream to start?\" (Hesitancy)</li><li>\"Do you wake up multiple times at night to pee?\" (Nocturia)</li><li>\"Is the stream weak or intermittent?\"</li><li>\"Do you feel you haven't emptied completely?\"</li><li>\"Do you have dribbling at the end?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>Prostate Cancer:</strong> Hard/craggy DRE.</li><li><strong>Urethral Stricture:</strong> History of trauma/STI.</li><li><strong>UTI:</strong> Dysuria, cloudy urine.</li><li><strong>Neurogenic Bladder:</strong> Diabetes, spinal cord injury.</li><li><strong>Bladder Stones:</strong> Intermittent stream.</li></ul></div>",
        "history": "<h3>LUTS (Lower Urinary Tract Symptoms)</h3><strong>Obstructive (Voiding):</strong> Hesitancy, poor stream, terminal dribbling, incomplete emptying. <br><strong>Irritative (Storage):</strong> Frequency, Urgency, Nocturia (>2 times/night). <br><strong>Complications:</strong> Acute Urinary Retention (AUR) - Painful inability to void. Recurrent UTIs. Bladder Stones. Overflow Incontinence. <br><strong>Risk Factors:</strong> Age (Main factor), Family History, Metabolic Syndrome.",
        "physiology": "<h3>Pathophysiology</h3>Nodular hyperplasia of the stromal and epithelial cells in the <strong>Transition Zone</strong> of the prostate (Periurethral). Driven by Dihydrotestosterone (DHT). Causes bladder outlet obstruction -> Detrusor hypertrophy -> Decompensation.",
        "exam": "<h3>DRE (Digital Rectal Exam)</h3>Prostate is Enlarged, Smooth, Firm, Symmetrical. Median Sulcus is preserved. Consistency like \"thenar eminence\". <br><h3>Abdomen</h3>Palpable bladder (chronic retention) - dull on percussion.",
        "inv": "<h3>Basic</h3><strong>Urinalysis:</strong> Rule out UTI/Hematuria. <strong>PSA (Prostate Specific Antigen):</strong> Rule out cancer (Counsel patient first). <strong>IPSS Score:</strong> Symptom severity grading. <br><h3>Advanced</h3><strong>Uroflowmetry:</strong> Objective measure. Qmax <10ml/s = Obstruction. <strong>Ultrasound KUB:</strong> Assess prostate volume and post-void residual urine.",
        "mgmt": "<h3>Lifestyle</h3>Fluid restriction before bed, reduce caffeine/alcohol, bladder training. <br><h3>Medical</h3><strong>Alpha-blockers (Tamsulosin):</strong> Relax smooth muscle of bladder neck. Rapid onset (days). Side effect: Retrograde ejaculation/Hypotension. <strong>5-Alpha Reductase Inhibitors (Finasteride):</strong> Shrink prostate size by blocking Testosterone->DHT. Takes 6 months. Side effect: Erectile dysfunction. <br><h3>Surgical</h3><strong>Indications:</strong> Refractory retention, Renal failure, Stones, Failed medical tx. <strong>TURP (Transurethral Resection of Prostate):</strong> Gold standard. \"Reaming out\" the core. <strong>Laser Enucleation (HoLEP):</strong> For large glands.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Acute Urinary Retention (AUR).</strong></li><li><strong>Bladder Stones.</strong></li><li><strong>Renal Failure:</strong> Chronic high pressure retention (Hydronephrosis).</li><li><strong>Hematuria.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Retrograde Ejaculation (70%).</strong></li><li><strong>Erectile Dysfunction.</strong></li><li><strong>Incontinence.</strong></li><li><strong>Stricture.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 PSA Density</div>PSA level divided by Prostate Volume. High density (>0.15) suggests Cancer, while low density suggests BPH (big prostate producing more PSA).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 TURP Syndrome</div>Dilutional hyponatremia caused by absorption of irrigation fluid (Glycine) during surgery. Signs: Confusion, nausea, hypertension, bradycardia.</div>"
    },
    {
        "id": "prostate_ca",
        "category": "Urology",
        "name": "Prostate Cancer",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Do you have family history of prostate cancer?\"</li><li>\"Do you have any new back pain?\" (Bone mets)</li><li>\"Any blood in your semen?\"</li><li>\"Weight loss?\"</li><li>\"LUTS?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>BPH:</strong> Smooth DRE.</li><li><strong>Prostatitis:</strong> Tender, boggy DRE.</li><li><strong>Calculi:</strong> Can feel hard.</li><li><strong>Stricture:</strong> Flow issue.</li><li><strong>Cystitis:</strong> Infection.</li></ul></div>",
        "history": "<h3>Presentation</h3><strong>Early:</strong> Often asymptomatic (raised PSA screening). <strong>Local:</strong> LUTS (similar to BPH), Hematospermia, Hematuria. <strong>Metastatic:</strong> Bone pain (Back pain), Pathological fractures, Weight loss, Spinal cord compression. <br><strong>Risk Factors:</strong> Age (rare <50), African ethnicity, Family History (BRCA2).",
        "physiology": "<h3>Pathology</h3>Adenocarcinoma arising mostly from the <strong>Peripheral Zone</strong> (accessible by DRE). Androgen dependent tumor.",
        "exam": "<h3>DRE</h3>Hard, Craggy, Irregular nodule/mass. Asymmetry. Loss of median sulcus. Consistency like \"knuckle\". <br><strong>Red Flag:</strong> Cauda Equina Signs (Saddle anesthesia, incontinence) from spinal metastasis.",
        "inv": "<h3>Diagnosis</h3><strong>PSA:</strong> Elevated (>4ng/ml). Also raised in BPH, UTI, Prostatitis. <strong>Multiparametric MRI Prostate:</strong> First line. PI-RADS scoring (1-5) to guide biopsy. <strong>Biopsy:</strong> Transrectal (TRUS) or Transperineal. Gleason Score (Histology grading). <br><h3>Staging</h3><strong>Bone Scan:</strong> Osteosclerotic (blastic) lesions. <strong>CT/PSMA PET:</strong> For mets.",
        "mgmt": "<h3>Localised Disease</h3><strong>Active Surveillance:</strong> Regular PSA/MRI for low risk (Gleason 6). <strong>Radical Prostatectomy:</strong> Robotic assisted (RALP). Risk of incontinence/ED. <strong>Radical Radiotherapy:</strong> External beam or Brachytherapy. <br><h3>Advanced/Metastatic</h3><strong>Androgen Deprivation Therapy (ADT):</strong> Medical castration (LHRH agonists - Goserelin/Leuprolide). <strong>Chemotherapy:</strong> Docetaxel. <strong>Novel Anti-androgens:</strong> Enzalutamide/Abiraterone.",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Spinal Cord Compression.</strong></li><li><strong>Pathological Fractures.</strong></li><li><strong>Lymphedema.</strong></li><li><strong>Renal Failure.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Incontinence (Post-op).</strong></li><li><strong>Erectile Dysfunction (Nerve damage).</strong></li><li><strong>Rectal Injury.</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Gleason Grading Groups</div>Modern system replaces just the score:<br><strong>Group 1:</strong> Gleason 6 (3+3) - Low risk.<br><strong>Group 2:</strong> Gleason 7 (3+4) - Favorable intermediate.<br><strong>Group 3:</strong> Gleason 7 (4+3) - Unfavorable.<br><strong>Group 5:</strong> Gleason 9-10 - High risk.</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Osteoblastic Metastasis</div>Unlike most cancers (breast/lung) which cause lytic (hole-punch) bone lesions, Prostate cancer causes <strong>sclerotic (dense white)</strong> lesions on X-ray.</div>"
    },
    {
        "id": "bladder_ca",
        "category": "Urology",
        "name": "Urinary Bladder Cancer",
        "clerking": "<div class=\"box box-green\"><span class=\"box-title\">Golden Questions (5)</span><ul><li>\"Is there blood in your urine? Is it painful?\" (Painless = Cancer until proven otherwise)</li><li>\"Do you smoke? How many pack years?\"</li><li>\"Do you work with chemicals, dyes, or rubber?\"</li><li>\"Clots in urine?\"</li><li>\"Pain on urination?\"</li></ul></div><div class=\"box box-blue\"><span class=\"box-title\">Differential Diagnosis (5)</span><ul><li><strong>UTI:</strong> Painful, frequency, cloudy.</li><li><strong>Renal Stones:</strong> Colicky pain.</li><li><strong>BPH:</strong> Enlarged prostate on DRE.</li><li><strong>Trauma:</strong> History.</li><li><strong>Glomerulonephritis:</strong> Microscopic hematuria, casts.</li></ul></div>",
        "history": "<h3>Chief Complaint</h3><strong>Painless Gross Hematuria:</strong> The hallmark sign. Visible blood in urine without pain. (Assume cancer until proven otherwise). <strong>Irritative Symptoms:</strong> Frequency, urgency, dysuria (mimics UTI, but culture negative). <br><strong>Risk Factors:</strong> <strong>Smoking:</strong> Single biggest risk factor (4x risk). Carcinogens excreted in urine. <strong>Occupational Exposure:</strong> Rubber, dye, textile industries (Aromatic amines, Aniline dyes). <strong>Schistosomiasis:</strong> Chronic infection (Squamous cell carcinoma risk). Drugs (Cyclophosphamide). Pelvic Radiation.",
        "physiology": "<h3>Pathology</h3><strong>Transitional Cell Carcinoma (TCC):</strong> Most common (>90%). <strong>Squamous Cell Carcinoma:</strong> Associated with Schistosomiasis/chronic stones.",
        "exam": "<h3>Findings</h3>Often unremarkable. <strong>Abdominal:</strong> Suprapubic mass (large tumor/retention). <strong>DRE/Bimanual Exam:</strong> To assess for pelvic mass or fixation (advanced disease). Signs of anemia (pallor).",
        "inv": "<h3>Diagnostic</h3><strong>Urinalysis:</strong> Microscopic hematuria. Cytology (malignant cells). <strong>Cystoscopy + Biopsy:</strong> Gold standard diagnosis. Visualizes tumor (papillary vs sessile). <br><h3>Staging</h3><strong>CT Urogram (CT KUB + Contrast):</strong> Assesses upper tracts (kidneys/ureters) and local extension. <strong>MRI Pelvis:</strong> For local staging of muscle invasion. <strong>TURBT (Transurethral Resection of Bladder Tumor):</strong> Diagnostic and staging procedure (determines muscle invasion).",
        "mgmt": "<h3>Non-Muscle Invasive (Superficial)</h3><strong>TURBT:</strong> Complete resection of the tumor. <strong>Intravesical Therapy:</strong> Chemotherapy (Mitomycin C post-op) or Immunotherapy (BCG for high-grade/CIS). <br><h3>Muscle Invasive</h3><strong>Radical Cystectomy:</strong> Removal of bladder + prostate/uterus + pelvic nodes. Requires urinary diversion (Ileal conduit or Neobladder). <strong>Chemotherapy:</strong> Neoadjuvant (before surgery) improves survival. <br><h3>Bladder Preservation</h3>Maximal TURBT + Chemotherapy + Radiation Therapy (Trimodality).",
        "complications": "<div class=\"box box-red\"><span class=\"box-title\">Pathological / Disease Progression</span><ul><li><strong>Hydronephrosis.</strong></li><li><strong>Metastasis.</strong></li><li><strong>Clot Retention.</strong></li></ul></div><div class=\"box box-yellow\"><span class=\"box-title\">Procedural / Treatment Related</span><ul><li><strong>Stoma complications (Hernia, retraction).</strong></li><li><strong>Erectile dysfunction.</strong></li><li><strong>Metabolic Acidosis (Neobladder).</strong></li></ul></div>",
        "pearls": "<div class=\"pearl-box\"><div class=\"pearl-title\">💎 Squamous Cell Carcinoma</div>While Transitional Cell Carcinoma (TCC) is the most common type, Squamous Cell is classically associated with <strong>Schistosomiasis</strong> infection (common in Egypt/Middle East).</div><div class=\"pearl-box\"><div class=\"pearl-title\">💎 Field Change Effect</div>The entire urothelium (from renal pelvis to urethra) is exposed to the same carcinogens in urine. Hence, bladder cancer patients are at risk for cancers in the ureter and renal pelvis too.</div>"
    }
]